applications/rhoFixedFlowFoam/tests/phaseChange/channel/0/U
FoamFile {version 2.0; format ascii; class volVectorField; object U;}
dimensions    [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField {
  "(INLET|OUTLET|WALL)" {type calculated; value uniform (0 0 0);}
  FRONTBACK {type empty;}
}
