applications/rhoFixedFlowFoam/tests/phaseChange/channel/system/fvSchemes
FoamFile {version 2.0; format ascii; class dictionary; object fvSchemes;}

ddtSchemes           {default Euler;}
gradSchemes          {default Gauss linear;}
divSchemes           {default none; div(phi,Y_PbI2_g) Gauss SuperBee;}
laplacianSchemes     {default Gauss linear corrected;}
interpolationSchemes {default linear;}
snGradSchemes        {default corrected;}
