applications/rhoFixedFlowFoam/tests/phaseChange/channel/system/fvSolution
/*------------------------------------------------------------------------------

system/fvSolution of tests/phaseChange/channel

  Loose correctors (tolerance 1e-8, relTol 0.1) and a tight final solve
  (1e-12, relTol 0).  The test rewrites Y_PbI2_gFinal for the loose case.

------------------------------------------------------------------------------*/
FoamFile {version 2.0; format ascii; class dictionary; object fvSolution;}

solvers {
  Y_PbI2_g {
    solver GAMG; smoother GaussSeidel; directSolveCoarsest yes;
    tolerance 1e-8; relTol 0.1;
  }
  Y_PbI2_gFinal {
    solver GAMG; smoother GaussSeidel; directSolveCoarsest yes;
    tolerance 1e-12; relTol 0;
  }
  Y_PbI2_s {solver diagonal;}
}
